/*********************************************************************************************************************
* @file				main.c
* @brief			无线通信
* @author			HeFei WeiHuang
* @version			2.0
* @Target core		GD32F450ZIT6
* @date				2021-4-2
********************************************************************************************************************/

/*********************************************************************************************************************

* 例程说明：

-此例程基于GD32F450学习板, 展示如何配置TXD引脚、RXD硬件和
USART，并通过无线串口模块向电脑发送信息

-在GD32F450学习板上，PD5连接TXD引脚，PD6连接RXD引脚，
串口使用USART1，波特率设置为115200。

-开启程序后通过串口持续发送消息“a usart transmit test example!”，
间隔1s。成功接收信息时，无线串口USB段模块LED闪烁一次。

********************************************************************************************************************/

#include "gd32f4xx.h"
#include "systick.h"
#include "LED.h"
#include "UART.h"
#include "headfile.h"
#include <stdio.h>

int main(void)
{
    /* 配置滴答计时器 */
    systick_config();

    LED_Init(LED_ALL);

    /* 配置UART，使用USART2，波特率设置为115200 */
    UART_Init(Wireless_UART, 115200U);

    while(1)
    {
        /* 串口发送测试信息 */
        printf("a usart transmit test example!\n");
        delay_1ms(1000);
    }
}

